// Content.js
import React, { Component } from 'react';
import '../components-styles/Content.css';

class Content extends Component {
  componentDidMount() {
    this.setupHobbyClickEvent();
  }

  setupHobbyClickEvent() {
    const firstHobby = document.getElementById("first-hobby");
    const secondHobby = document.getElementById("second-hobby");

    firstHobby.onclick = () => {
      this.toggleHobbyClass(firstHobby);
    };

    secondHobby.onclick = () => {
      this.toggleHobbyClass(secondHobby);
    };
  }

  toggleHobbyClass(element) {
    if (element.className === "orange") {
      element.className = "lime";
    } else {
      element.className = "orange";
    }
  }

  render() {
    return (
      <div>
        <p>
          Дата народження: 05.09.2003 <br />
          Місце народження: м.Донецьк
        </p>
        <p>
          Освіта: Донецький ліцей "Лідер" м.Донецьк, Спеціалізована школа № 66 м. Маріуполя, Ірпінський ліцей №2 м.Ірпінь, НТУУ "КПІ" м.Київ
        </p>
        <h3>Хоббі:</h3>
        <ul>
          <li id="first-hobby">Спорт</li>
          <li id="second-hobby">Історія</li>
          <li>Нумізматика</li>
          <li>Геополітика</li>
          <li>Кульова стрільба</li>
        </ul>
        <h3>Улюблені книги:</h3>
        <ol>
          <li>"Вуличний кот на ім'я Боб" Д.Боуен</li>
          <li>"Чайка Джонатан Лівінгстоун" Р.Бах</li>
          <li>"Скотоферма" Д.Орвелл</li>
        </ol>
        <h2>Івано-Франківськ</h2>
        <p>Івано-Франківськ - місто в Україні, обласний центр Івано-Франківської області, економічний і культурний центр Прикарпаття.<br />
          Один із трьох головних центрів історико-географічного регіону Галичина.Гуляючи по Івано-Франківську, ви часто будете зустрічати назви «Станіслав» або «Станіславів».<br />
          Справа в тому, що це стара назва міста, яку він носив з 1662 і загалом до 1962 року.
          Нову назву на честь Івана Франка місто отримало 9 листопада 1962 року в честь свого 300-річного ювілею.
        </p>
        <p>У 1919 році Івано-Франківськ тимчасово став столицею ЗУНР. Процес був досить складний, адже в основному столицею був Львів, пару місяців 1918 року – Тернопіль,
          а в 1919 році – Станіславів.<br />Хоча він носив почесне звання лише з січня до травня, саме тут приймалися найважливіші рішення, але незабаром війська ЗУНР повинні були відступити за Збруч.
          Серед маленьких містечок Західної України <br /> Станіславів одним з перших отримав повноцінне електропостачання.
          Перші лампочки на залізничному вокзалі запалили в 19 столітті. До речі, сам вокзал тоді називали «Двірець».
          В Івано-Франківську також <br /> знаходиться адміністрація Івано-Франківської міської територіальної громади. Населення міста становить 238196 осіб (оцінка на 2022 рік).
        </p>
      </div>
    );
  }
}

export default Content;
